//EMPIND02  JOB (KC03HF7),'DLJ WSC NEBR',REGION=0M,CLASS=A,MSGCLASS=H,
//         NOTIFY=&SYSUID,MSGLEVEL=(1,1)
//*-----------------------------------------------------------*
//* BASIC COMPILE, LINK, AND GO JCL
//*-----------------------------------------------------------*
//COBOL1   EXEC IGYWCLG,REGION=0M,
//         PARM.COBOL='TEST,RENT,APOST,OBJECT,NODYNAM,'
//COBOL.STEPLIB DD DSN=IGY640.SIGYCOMP,DISP=SHR
//COBOL.SYSIN   DD DISP=SHR,DSN=KC03HF7.CIS352.COBOL(EMPIND02)
//GO.EMPTRAN    DD DISP=SHR,DSN=KC03HF7.CIS352.EMPTRAN
//GO.EMPMASTI   DD DISP=SHR,DSN=KC03HF7.EMPMASTI.KSDS
//GO.ERRTRAN    DD DISP=OLD,DSN=KC03HF7.CIS352.ERRTRAN3
